// args: none
// return: bool (use this languange)

private [{_bMatch}];
_bMatch = call preprocessFile "Util\LangIsChn.sqf";

if _bMatch then {
	private [{_i}, {_capacity}];
	_i = 0; _capacity = 4;
	TzkInGameText resize _capicity;

	_f = {
		if (_i >= _capacity) then {
			_capacity = _capacity * 2;
			TzkInGameText resize _capacity;
		};
		TzkInGameText set [_i, _this];
		_i = _i + 1;
	};

	// All exist item's index and their order CAN'T BE CHANGED
	[
		  "您所发射的炮弹已飞行超
		过3秒。由于火炮单位附近
		%1米内有己方关键建筑，
		敌AI火炮无法针对性反制，
		因此炮弹将被删除。如欲远
		距离炮击，请移动火炮单位"
		, "基地附近%1米内的火炮单位不允许射击"
		, "不允许炮击敌方基地附近的坐标"
		, "准备炮击坐标阶段脚本失败。命令中止"
		, "准备炮击坐标中。请等待……"
		, "向目的地移动，距离%1米" // 5
		, "目标在远处，有可能打空"
		, "向补给处移动，补充弹药"
		, "如果我离你太远，可能收不到弹夹，记得用 Unit 看我一眼"
		, "切换弹夹中。如果我离你太远，记得用 Unit 看我一眼"
		, "自动探测暂停。等待补给完毕" // 10
	] call _f; // 000
	[
		 "直升机"
		,"步战车"
		,"卡车"
		,"船只"
		,"客机"
		,"医疗车"
		,"维修卡车"
		,"吉普车"
	] call _f; // 001
	[
		 "榴弹炮"
		,"迫击炮"
		,"地面机枪"
		,"机枪塔"
		,"炮塔"
	] call _f; // 002
	[
		 "重坦克"
		,"轻坦克"
		,"火炮"
		,"AT步战车"
		,"AA载具"
		,"武装直升机"
		,"固定翼"
		,"医疗步战车"
		,"运输车"
		,"运输船"
		,"运输步战车"
		,"运输飞机"
		,"战船"
		,"战斗吉普车"
		,"雷达车"
		,"维修卡车"
	] call _f; // 003

	"仅杀死玩家" call _f; // 004

	"Alt 单击及 Shift-Alt 单击用于 RTS 风格的交互。更多细节可参看笔记本。
	\n\n
	可使用无线电系统。在不同的载具中按下 0-0 可呼出不同的无线电频道。
	\n
	0-0-1 总是用于切换 RTS 地图点击模式。
	\n
	0-0-2 总是用于 TZK 设置界面。" call _f; // 005

	"" call _f; // 006
	"" call _f; // 007

	"请选择距离陆地足够近的点" call _f; // 008

	"这个对话框提供了一些按钮，用于对部分 bug 进行数据查询或修正。" call _f; // 009
	"队伍单位检测" call _f; // 010
	"地雷参数检查" call _f; // 011

	{这个请求将试图移除队伍中的“幽灵”单位（往往由 join 导致）。} call _f; // 012

	[
		  "点击功能描述右侧的按钮，根据提示操作。"
		, "按下你想要设置的按键."
		, "设置成功。点击其他按钮，继续完成你的按钮自定义。"
		, "按键 %1 与功能 %2 冲突。设置失败。请采用其他按键。"
		, "%1 是保留的按键。请采用其他按键。"
		, "空格键只为【确认】而设，不允许修改。"
	] call _f; // 013
	"自定义快捷键" call _f; // 014
	[
		  "移动"
		, "清理命令"
		, "停止"
		, "登车"
		, "占领建筑"
		, "回收载具"
		, "炮击命令"
		, "购买装备"

		, "管理队伍显示"

		, "选择玩家队伍单位"

		, "join"
		, "消除单位"
		, "切换火炮弹夹"

		, "attach 中间位置"
		, "attach 右边位置"
		, "attach 左边位置"
		, "detach 中间位置"
		, "detach 右边位置"
		, "detach 左边位置"

		, "区域对话框"
		, "路点对话框"
		, "小队命令对话框"
		, "坐标对话框"
	] call _f; // 015
	[
		  "拆除建筑"
		, "架桥"

		, "管理队伍显示"

		, "RTS 对话框"
		, "路点对话框"
		, "小队命令对话框"
		, "坐标对话框"

		, "AI炮击区域"
		, "玩家炮击区域"
		, "AI埋雷区域"
		, "玩家埋雷区域"

		, "设置障碍物"

		, "顺时针 30°"
		, "逆时针 30°"
		, "顺时针 10°"
		, "逆时针 10°"
	] call _f; // 016
	[
		  "工人"
		, "建造"

		, "管理队伍显示"

		, "RTS 对话框"
		, "区域对话框"
		, "路点对话框"
		, "小队命令对话框"
	] call _f; // 017
	[
		  "设置"
		, "清除"

		, "管理队伍显示"

		, "co"
		, "wp"

		, "RTS 对话框"
		, "区域对话框"
		, "坐标对话框"
		, "小队命令对话框"
	] call _f; // 018
	[
		  "移动"
		, "清理命令"
		, "停止"
		, "炮击命令"
		, "购买装备"

		, "维修医疗"
		, "补给弹药"
		, "登车"

		, "join"
		, "消除单位"
		, "切换火炮弹夹"

		, "attach 中间位置"
		, "attach 右边位置"
		, "attach 左边位置"
		, "detach 中间位置"
		, "detach 右边位置"
		, "detach 左边位置"

		, "RTS 对话框"
		, "区域对话框"
		, "路点对话框"
		, "坐标对话框"
	] call _f; // 019
	// RTS 界面文案 1
	[
		  "坐标"
		, "机枪塔"
		, "摧毁敌方建筑"
		, "在该坐标附近100米范围内，没有敌方建筑\n或该坐标附近30米范围内，没有我军坦克/榴弹炮"
		, "清理图标"					// 4
		, "拆除"
		, "相交"
		, "朝向"
		, "距离"
		, "暂不支持"					// 9
		, "这个命令不允许用在其他玩家的队伍。"
		, "这个命令不允许用在其他玩家的队伍。"
		, "后座乘员跳车\n驾驶员、炮手、指挥官不会跳车"
		, "要求所有单位下车\n如果载具内有玩家的单位，它们可能会阻碍后续AI单位下车"
		, "这个按钮只显示信息。请点击其它按钮" // 14
		, "捕获异常状态"
		, "目前通过区域对话框建造房顶有bug\n暂时禁用这个设计"
		, "命令未选取"
		, "请使用 4-1."
		, "请使用 Alt 点击" // 19
		, "请使用 3-6."
		, "造建筑"
		, "建筑类型"
		, "方位角"
		, "修正值"					// 24
		, "工厂"
		, "其他建筑"
		, "防御塔"
		, "火炮单位"
		, "围墙"						// 29
		, "障碍物"
		, "建筑未选取"
		, "切换座位"
		, "座位"
		, "仅在载具内只有一个乘员，且载具与乘员归属于同一个游戏客户端时，命令才有效" // 34
		, "驾驶员"
		, "炮手"
		, "乘客"
		, "座位未选取"
	] call _f; // 020
	// 建筑名称列表
	[
		  "对空雷达 - 范围4000m米"
		, "Map 塔"
		, "Unit 塔"
		, "轻工"
		, "指挥中心"
		, "兵营"
		, "重工"
		, "机场"
		, "船坞"
		, "野战医院"
		, "加油站"
		, "迫击炮 81 (82) mm"
		, "M119 105mm 榴弹炮"
		, "D30-A 榴弹炮"
		, "机枪碉堡"
		, "机枪塔"
		, "机枪塔"
		, "机枪 12.7mm"
		, "Static Launcher"
		, "Static MG 12.7mm"
		, "Static GL"
		, "Static AT-Launcher"
		, "T55 碉堡"
		, "围墙"
		, "围墙 矮"
		, "天花板"
		, "天花板 高"
		, "坦克防护墙"
		, "火炮发射平台"
		, "沙包"
		, "反坦克栅栏"
		, "弹药箱"
		, "直升机 H"
		, "铁丝网"
		, localize {TZK_LANG_GAP_GENERATOR}
		, "桥梁"
		, "天花板 10米高"
		, "天花板 20米高"
		, "MHQ 围墙"
	] call _f; // 021
	[
		  "确认"

		, "类型 1"
		, "类型 2"
		, "类型 3"
		, "类型 4"
		, "类型 5"
		, "类型 6"

		, "第 1 项"
		, "第 2 项"
		, "第 3 项"
		, "第 4 项"
		, "第 5 项"
		, "第 6 项"
		, "第 7 项"
		, "第 8 项"
		, "第 9 项"
	] call _f; // 022
	[
		  "确认"

		, "第 1 项"
		, "第 2 项"
		, "第 3 项"
		, "第 4 项"
		, "第 5 项"
		, "第 6 项"
		, "第 7 项"
		, "第 8 项"
		, "第 9 项"
		, "第 10 项"
	] call _f; // 023
	// 指挥官规则
	[
		  "指挥官规则禁用了所有飞行器。可要求指挥官重新决定规则"
		, "指挥官规则禁用了裂缝产生器。可要求指挥官重新决定规则"
		, "指挥官规则只允许最多造3个工厂。可要求指挥官重新决定规则"
		, "指挥官规则菜单"
	] call _f; // 024
	// 无线电
	[
		  "TZK任务设置"
		, "自我医疗"
		, "MHQ建造菜单"
		, "Sup建造菜单"
		, "购买高清夜视仪"
		, "快速补给 AA" // 5
		, "快速补给 AT"
		, "快速补给 RPG"
		, "刷新无线电列表"
		, "开启 RTS 单击交互"
		, "关闭 RTS 单击交互" // 10
		, "重置建筑法向量"
		, "切换到驾驶席"
		, "切换到炮手席"
		, "弹出所有乘客"
		, "弹出一个乘客" // 15
		, "运输关闭"
		, "运输开启"
		, "下一页..."
		, "干扰弹关闭"
		, "干扰弹开启" // 20
		, "获取附近飞机参数"
		, "弹出AI乘客"
		, "推进喷射开启"
		, "推进喷射关闭"
		, "切换图标显示" // 25
		, "回到观察者模式"
		, "切换 %1m/s 弹夹"
	] call _f; // 025
	// tg
	[
		  "倒计时%1分钟"
		, "发现火炮（探测密度：%1）。推断坐标：%2"
		, "先别下线！收到服务器
		信号。当前时刻：
		%1"
		, "等待指挥官选定起始位置..."
		, "等待数据初始化..."
		, "队伍 %1 已满（包括建造中、排队中的单位）。终止对 %2 的建造" // 5
		, "工人无法接近建筑。菜鸡指挥官"
		, "数据初始化完毕"
		, "你被暂时屏蔽了
		网络状况不佳
		先别下线，稍等一会儿"
		, "网络恢复
		屏蔽解除"
		, "%1 遭受敌人攻击。请支援" // 10
		, "%1 附近没有敌人（2倍视距内）。城防部队蛰伏"
		, "敌人接近 %1（2倍视距内）。城防部队激活"
	] call _f; // 026
	[
		  "确认"

		, "按钮 1"
		, "按钮 2"
		, "按钮 3"

		, "图标 1"
		, "图标 2"
		, "图标 3"
		, "图标 4"
		, "图标 5"
		, "图标 6"
		, "图标 7"
		, "图标 8"
		, "图标 9"
		, "图标 0"
	] call _f; // 027
	[
		  "确认"

		, "大角度 1"
		, "大角度 2"
		, "大角度 3"
		, "大角度 4"

		, "图标 1"
		, "图标 2"
		, "图标 3"
		, "图标 4"
		, "图标 5"
		, "图标 6"
		, "图标 7"
		, "图标 8"
		, "图标 9"
		, "图标 0"
	] call _f; // 028
	// 区域图标
	[
		  "火炮"
		, "地雷"
		, "玩家"
		, "阵营"
		, "区域"
		, "图标过大，无法设置为
		%1区域" // 5
		, "区域未选取"
	] call _f; // 029
	// RTS 界面文案 2
	[
		  "什么都不做"
		, "切换火炮弹夹"
		, "选择 AI 队伍"
		, "选择工人"
		, "选择基地守备单位"
		, "选择玩家队伍单位"
	] call _f; // 030
	// RTS 指挥官命令消息提示
	[
		"向 阵营火炮区域%1 的炮击命令"
	] call _f; // 031

	// script count check. Check index with last literal value
	if (_i != 31 + 1) then {
		player globalChat "脚本数目不匹配！";
	};

	// free extra memory
	TzkInGameText resize _i;
};

_bMatch